docs/images/core_ontology.gv
digraph core_ontology {
	graph [fontname="Helvetica,Arial,sans-serif" fontsize=10 layout=neato overlap=false splines=ortho]
	node [fillcolor=darkgoldenrod1 fontname="Helvetica,Arial,sans-serif" fontsize=10 shape=record]
	edge [arrowsize=0.3 fontname="Helvetica,Arial,sans-serif" fontsize=10 penwidth=0.3]
	Activity [label=<{<b>Activity</b> | <i><b> domain:core</b></i> <br align="left"/>endDateTime:dateTime<br align="left"/>id:string<br align="left"/>name:string<br align="left"/>startDateTime:dateTime<br align="left"/>}> style=filled]
	Actor [label=<{<b>Actor</b> | <i><b> domain:core</b></i> <br align="left"/>id:string<br align="left"/>name:string<br align="left"/>}> style=filled]
	Address [label=<{<b>Address</b> | <i><b> domain:core</b></i> <br align="left"/>street:string<br align="left"/>houseNumber:string<br align="left"/>postalCode:string<br align="left"/>city:string<br align="left"/>country:string<br align="left"/>}> style=filled]
	ConceptualObject [label=<{<b>ConceptualObject</b> | <i><b> domain:core</b></i> <br align="left"/>id:string<br align="left"/>name:string<br align="left"/>}> style=filled]
	PhysicalObject [label=<{<b>PhysicalObject</b> | <i><b> domain:core</b></i> <br align="left"/>id:string<br align="left"/>name:string<br align="left"/>}> style=filled]
	Place [label=<{<b>Place</b> | <i><b> domain:core</b></i> <br align="left"/>id:string<br align="left"/>name:string<br align="left"/>}> style=filled]
	hasAddress [label=hasAddress fillcolor=darkolivegreen2 fontsize=8 height=0 shape=plaintext style=filled width=0]
	describesPhysicalObject [label="describesPhysicalObject / 
describedByConceptualObject ➝" fillcolor=darkolivegreen2 fontsize=8 height=0 shape=plaintext style=filled width=0]
	hasParticipant [label="hasParticipant / 
participatesIn ➝" fillcolor=darkolivegreen2 fontsize=8 height=0 shape=plaintext style=filled width=0]
	refersToConceptualObject [label="refersToConceptualObject / 
involvedIn ➝" fillcolor=darkolivegreen2 fontsize=8 height=0 shape=plaintext style=filled width=0]
	refersToPhysicalObject [label="refersToPhysicalObject / 
involvedIn ➝" fillcolor=darkolivegreen2 fontsize=8 height=0 shape=plaintext style=filled width=0]
	relatedToPlace [label=relatedToPlace fillcolor=darkolivegreen2 fontsize=8 height=0 shape=plaintext style=filled width=0]
	takesPlaceAt [label="takesPlaceAt / 
hosts ➝" fillcolor=darkolivegreen2 fontsize=8 height=0 shape=plaintext style=filled width=0]
	Place -> hasAddress [arrowhead=none]
	hasAddress -> Address
	ConceptualObject -> describesPhysicalObject [arrowhead=none]
	describesPhysicalObject -> PhysicalObject
	Activity -> hasParticipant [arrowhead=none]
	hasParticipant -> Actor
	Activity -> refersToConceptualObject [arrowhead=none]
	refersToConceptualObject -> ConceptualObject
	Activity -> refersToPhysicalObject [arrowhead=none]
	refersToPhysicalObject -> PhysicalObject
	Actor -> relatedToPlace [arrowhead=none]
	relatedToPlace -> Place
	Activity -> takesPlaceAt [arrowhead=none]
	takesPlaceAt -> Place
	Address -> ConceptualObject [style=dashed]
}
