docs/ontology_governance_process.md
```mermaid
---
title: Bank example
---

classDiagram 
   class Activity~core~{
       endDateTime dateTime
       id string
       name string
       startDateTime dateTime
   }
   class Actor~core~{
       id string
       name string
   }
   class Address~core~{
       street string
       houseNumber string
       postalCode string
       city string
       country string
   }
   class ConceptualObject~core~{
       id string
       name string
   }
   class PhysicalObject~core~{
       id string
       name string
   }
   class Place~core~{
       id string
       name string
   }
   Place --> Address : hasAddress
   ConceptualObject --> PhysicalObject : describesPhysicalObject
   Activity --> Actor : hasParticipant
   Activity --> ConceptualObject : refersToConceptualObject
   Activity --> PhysicalObject : refersToPhysicalObject\nabc
   Actor --> Place : relatedToPlace
   Activity --> Place : takesPlaceAt
```
